In [227]:
import pandas as pd
import numpy as np

In [3]:
data = pd.Series([0.2,0.32,0.12])
data

0    0.20
1    0.32
2    0.12
dtype: float64

In [4]:
print(data.index)
print(data.values)

RangeIndex(start=0, stop=3, step=1)
[0.2  0.32 0.12]

In [10]:
data = pd.Series([0.2,0.32,0.12], index = ['s','f','h'])
data

s    0.20
f    0.32
h    0.12
dtype: float64

In [11]:
data['f']

0.32

In [33]:
popalution_dict = {
    'Krakow':123123,
    'California':32321312,
    'Warszawa': 6746234,
    'New York': 65423443,
    'Sosnowiec':-1,
}

popalution_dict

{'Krakow': 123123,
 'California': 32321312,
 'Warszawa': 6746234,
 'New York': 65423443,
 'Sosnowiec': -1}

In [34]:
popalution = pd.Series(popalution_dict)
popalution

Krakow          123123
California    32321312
Warszawa       6746234
New York      65423443
Sosnowiec           -1
dtype: int64

In [35]:
popalution['Sosnowiec']

-1

In [36]:
popalution['California': 'New York']

California    32321312
Warszawa       6746234
New York      65423443
dtype: int64

In [47]:
series = [
    pd.Series([2,3,4]),
    pd.Series(5, index=[1,2,3]),
    pd.Series({2:'a',4:'d',8:'f'}),
    pd.Series(np.arange(10), index =np.arange(10,20))
]
series

[0    2
 1    3
 2    4
 dtype: int64,
 1    5
 2    5
 3    5
 dtype: int64,
 2    a
 4    d
 8    f
 dtype: object,
 10    0
 11    1
 12    2
 13    3
 14    4
 15    5
 16    6
 17    7
 18    8
 19    9
 dtype: int32]

In [48]:
for i in series:
    print(i)

0    2
1    3
2    4
dtype: int64
1    5
2    5
3    5
dtype: int64
2    a
4    d
8    f
dtype: object
10    0
11    1
12    2
13    3
14    4
15    5
16    6
17    7
18    8
19    9
dtype: int32

### Data Frame

In [51]:
area_dict={
    'Krakow':2131,
    'California':231232,
    'New York':786324,
    'Illonis':4234,
}

area = pd.Series(area_dict)
area

Krakow          2131
California    231232
New York      786324
Illonis         4234
dtype: int64

In [54]:
state = pd.DataFrame({'population':popalution,
                     'area':area})
state

            population      area
California  32321312.0  231232.0
Illonis            NaN    4234.0
Krakow        123123.0    2131.0
New York    65423443.0  786324.0
Sosnowiec         -1.0       NaN
Warszawa     6746234.0       NaN

In [56]:
state.index

Index(['California', 'Illonis', 'Krakow', 'New York', 'Sosnowiec', 'Warszawa'], dtype='object')

In [58]:
state.columns

Index(['population', 'area'], dtype='object')

In [60]:
state[['population','area']]

            population      area
California  32321312.0  231232.0
Illonis            NaN    4234.0
Krakow        123123.0    2131.0
New York    65423443.0  786324.0
Sosnowiec         -1.0       NaN
Warszawa     6746234.0       NaN

In [61]:
state[['population']]

            population
California  32321312.0
Illonis            NaN
Krakow        123123.0
New York    65423443.0
Sosnowiec         -1.0
Warszawa     6746234.0

In [62]:
data = [{'a':i,'b':2*i}for i in range(3)]
data

[{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 4}]

In [66]:
dfs = [
    pd.DataFrame(popalution, columns=['population']),
    pd.DataFrame(data),
    pd.DataFrame([{'a':1,'b':2},
                {'b':3,'c':4}]),
    pd.DataFrame({'population':popalution,
                     'area':area}),
    pd.DataFrame(np.random.rand(3,2),
                columns =['foo','bar'],
                index = ['a','b','c'])
    
]

for i in dfs:
    print(i)

            population
Krakow          123123
California    32321312
Warszawa       6746234
New York      65423443
Sosnowiec           -1
   a  b
0  0  0
1  1  2
2  2  4
     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0
            population      area
California  32321312.0  231232.0
Illonis            NaN    4234.0
Krakow        123123.0    2131.0
New York    65423443.0  786324.0
Sosnowiec         -1.0       NaN
Warszawa     6746234.0       NaN
        foo       bar
a  0.665249  0.273167
b  0.682448  0.784731
c  0.384677  0.518954

### Index

In [67]:
dfs[0].index

Index(['Krakow', 'California', 'Warszawa', 'New York', 'Sosnowiec'], dtype='object')

In [68]:
ind = pd.Index([2,3,4,5,6])
ind

Int64Index([2, 3, 4, 5, 6], dtype='int64')

In [70]:
a = np.array([1,2,3])
a[0]=3
a

array([3, 2, 3])

In [72]:
ind[1]=3 # w index nie mozna zmieniac wartości

TypeError: Index does not support mutable operations

## Indeskowanie i wybieranie danych

In [75]:
data = pd.Series(['s','b','c'], index = [1,3,5])
data

1    s
3    b
5    c
dtype: object

In [76]:
data[1] # index typu Series

's'

In [79]:
data[1:3] #index  z numpy

3    b
5    c
dtype: object

In [80]:
#loc, iloc

data.loc[1]

's'

In [81]:
data.loc[1:3]

1    s
3    b
dtype: object

In [82]:
data.iloc[1]

'b'

In [83]:
data.iloc[1:3]

3    b
5    c
dtype: object

## wybieranie danych z DataFrame

In [84]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [85]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [87]:
data['density'] = data['pop']/data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [88]:
data['pop']*2

California    76665042
Texas         52896386
New York      39302254
Florida       39105720
Illinois      25764270
Name: pop, dtype: int64

In [90]:
data['density'] = (data['pop']/data['area']).round(2)
data

              area       pop  density
California  423967  38332521    90.41
Texas       695662  26448193    38.02
New York    141297  19651127   139.08
Florida     170312  19552860   114.81
Illinois    149995  12882135    85.88

In [91]:
data.iloc[:3,:2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [93]:
data.loc[:'Texas',:'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193

In [94]:
data.density >100

California    False
Texas         False
New York       True
Florida        True
Illinois      False
Name: density, dtype: bool

In [95]:
data.loc[data.density >100]

            area       pop  density
New York  141297  19651127   139.08
Florida   170312  19552860   114.81

In [97]:
data.loc[data.density >100, ['pop','density']]

               pop  density
New York  19651127   139.08
Florida   19552860   114.81

In [98]:
data.iloc[0,2]=90

In [99]:
data

              area       pop  density
California  423967  38332521    90.00
Texas       695662  26448193    38.02
New York    141297  19651127   139.08
Florida     170312  19552860   114.81
Illinois    149995  12882135    85.88

In [100]:
data.loc['California','density']=66
data

              area       pop  density
California  423967  38332521    66.00
Texas       695662  26448193    38.02
New York    141297  19651127   139.08
Florida     170312  19552860   114.81
Illinois    149995  12882135    85.88

# Operowanie na brakujących danych

In [103]:
vals1 = np.array([1,2,None,4])
vals1

array([1, 2, None, 4], dtype=object)

In [106]:
type(None)

NoneType

In [108]:
for dtype in ['object','int']:
    print(f"dtype={dtype}")
    %timeit np.array(1E6, dtype=dtype).sum()
    print()

dtype=object
1.72 µs ± 61.1 ns per loop (mean ± std. dev. of 7 runs, 1000000 loops each)

dtype=int
1.72 µs ± 40.6 ns per loop (mean ± std. dev. of 7 runs, 1000000 loops each)

In [112]:
type(np.nan) #nan nie jest lizcba ale mozna robic operacje jak na liczbach

float

In [113]:
1 + np.nan

nan

In [115]:
vals2 = np.array([1,np.nan,2,3])
vals2.dtype

dtype('float64')

In [116]:
np.nansum(vals2)

6.0

In [125]:
a = pd.Series([1,2,np.nan,None,5])
a

0    1.0
1    2.0
2    NaN
3    NaN
4    5.0
dtype: float64

In [126]:
a.sum()

8.0

In [127]:
a.isnull() #znajdowanie pustych wartosci

0    False
1    False
2     True
3     True
4    False
dtype: bool

In [128]:
a[a.isnull()] #wybieranie nie pustych wartości**

2   NaN
3   NaN
dtype: float64

In [130]:
a.dropna() #To lepsze niz a[a.isnull()] xD

0    1.0
1    2.0
4    5.0
dtype: float64

In [132]:
 area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': None,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area         pop
California  423967  38332521.0
Texas       695662         NaN
New York    141297  19651127.0
Florida     170312  19552860.0
Illinois    149995  12882135.0

In [136]:
data[data['pop'].notnull()]

              area         pop
California  423967  38332521.0
New York    141297  19651127.0
Florida     170312  19552860.0
Illinois    149995  12882135.0

# łaczenie DataFrame

In [139]:
pd.concat? #łaczenie kolumn

In [141]:
ser1=pd.Series(['a','b','c'], index =[1,2,3])
ser2=pd.Series(['f','g','h'], index =[6,4,5])

In [142]:
pd.concat([ser1, ser2])

1    a
2    b
3    c
6    f
4    g
5    h
dtype: object

In [145]:
def make_df(cols,ind):#łaczenie kolum i wierszy np: A0, B1, C2
    data = {c:[str(c)+str(i) for i in ind]for c in cols} #<-- digit comprehantion
    return pd.DataFrame(data,ind)
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [157]:
df1 = make_df('AB',[1,2])
df2 = make_df('AB',[3,4])

df1, df2

(    A   B
 1  A1  B1
 2  A2  B2,
     A   B
 3  A3  B3
 4  A4  B4)

In [154]:
pd.concat([df1,df2])

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [155]:
a=pd.concat([df1,df2], axis=1)
a

     A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4

In [153]:
a['A']

     A    A
1   A1  NaN
2   A2  NaN
3  NaN   A3
4  NaN   A4

In [158]:
df1.append(df2)

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

# SQL Joiny

In [170]:
 df1 = pd.DataFrame({'employee':['Bob','Jake','Lisa','Sue'],
                    'group':['Accounting','Engineering','Engineering','HR']})
df2=pd.DataFrame({'employee':['Bob','Jake','Lisa','Sue'],
                 'hire_date':[2008,2004,2012,2014]})

df2

  employee  hire_date
0      Bob       2008
1     Jake       2004
2     Lisa       2012
3      Sue       2014

In [168]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [169]:
df3 = pd.merge(df1,df2) #łaczy tabele data frame
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2004
2     Lisa  Engineering       2012
3      Sue           HR       2014

In [172]:
df4 = pd.DataFrame({'group':['Accounting','Engineering','HR'],
                   'supervisor':['Carly','Guido','Steve']})
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [184]:
df=pd.merge(df3,df4)
df

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2004      Guido
2     Lisa  Engineering       2012      Guido
3      Sue           HR       2014      Steve

In [185]:
df[['employee','group']]

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

 *left - wszystkie rkordy z tab A dla które maja warosci w tab. B połączy
 
 *right
 
 *outer - łączy obydwie tabele
 
 *inner - robi czesc wspolna z tabeli A i B
 
 
 *cross

In [186]:
df5=make_df('AB',[1,2,4])
df6=make_df('ABCD',[1,2,5,6])
df5

    A   B
1  A1  B1
2  A2  B2
4  A4  B4

In [187]:
df6

    A   B   C   D
1  A1  B1  C1  D1
2  A2  B2  C2  D2
5  A5  B5  C5  D5
6  A6  B6  C6  D6

In [188]:
pd.merge(df5,df6, on='A',how='left')

    A B_x  B_y    C    D
0  A1  B1   B1   C1   D1
1  A2  B2   B2   C2   D2
2  A4  B4  NaN  NaN  NaN

In [189]:
pd.merge(df5,df6, on='B',how='right')

   A_x   B A_y   C   D
0   A1  B1  A1  C1  D1
1   A2  B2  A2  C2  D2
2  NaN  B5  A5  C5  D5
3  NaN  B6  A6  C6  D6

In [190]:
pd.merge(df5,df6, on='A',how='right')

    A  B_x B_y   C   D
0  A1   B1  B1  C1  D1
1  A2   B2  B2  C2  D2
2  A5  NaN  B5  C5  D5
3  A6  NaN  B6  C6  D6

In [191]:
pd.merge(df5,df6, on='A',how='outer')

    A  B_x  B_y    C    D
0  A1   B1   B1   C1   D1
1  A2   B2   B2   C2   D2
2  A4   B4  NaN  NaN  NaN
3  A5  NaN   B5   C5   D5
4  A6  NaN   B6   C6   D6

# Agregacja i grupowanie

In [194]:
df = pd.DataFrame({'A': np.random.rand(5),
                   'B': np.random.rand(5)})

df

          A         B
0  0.894704  0.606725
1  0.367392  0.747572
2  0.670766  0.572142
3  0.481430  0.386686
4  0.966058  0.451468

In [196]:
df.mean() #liczy średnią

A    0.676070
B    0.552918
dtype: float64

-Count()

-first()

-last()

-min()

-max()

In [198]:
df.min()

A    0.367392
B    0.386686
dtype: float64

In [204]:
df= pd.DataFrame({'key':['A','B','C','A','B','C'],
                  'data': range(6)}, columns = ['key','data'])

df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [207]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [209]:
df.groupby('key')['data'].median()

key
A    1.5
B    2.5
C    3.5
Name: data, dtype: float64

# Wektorowe operacje na pandasie

In [213]:
data = ['peter','paul','MaRy','GUido']
[s.capitalize() for s in data]

['Peter', 'Paul', 'Mary', 'Guido']

In [214]:
names = pd.Series(data)
names

0    peter
1     paul
2     MaRy
3    GUido
dtype: object

In [215]:
names.str.capitalize()

0    Peter
1     Paul
2     Mary
3    Guido
dtype: object

In [217]:
names.str.lower()

0    peter
1     paul
2     mary
3    guido
dtype: object

In [218]:
names.str.len()

0    5
1    4
2    4
3    5
dtype: int64

In [220]:
names.str.startswith('p')

0     True
1     True
2    False
3    False
dtype: bool

In [223]:
names[names.str.lower().str.startswith('p').fillna(False)]

0    peter
1     paul
dtype: object

In [230]:
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
                   'Eric Idle', 'Terry Jones', 'Michael Palin'])
monte

0    Graham Chapman
1       John Cleese
2     Terry Gilliam
3         Eric Idle
4       Terry Jones
5     Michael Palin
dtype: object

In [232]:
monte.str.split()

0    [Graham, Chapman]
1       [John, Cleese]
2     [Terry, Gilliam]
3         [Eric, Idle]
4       [Terry, Jones]
5     [Michael, Palin]
dtype: object

# Metodty z wyrażeniami regularynymi

In [234]:
monte.str.extract('([A-Za-z]+)', expand = False) #Series

0     Graham
1       John
2      Terry
3       Eric
4      Terry
5    Michael
dtype: object

In [235]:
monte.str.extract('([A-Za-z]+)') #DataFrame

         0
0   Graham
1     John
2    Terry
3     Eric
4    Terry
5  Michael

In [236]:
monte.str[0:3]

0    Gra
1    Joh
2    Ter
3    Eri
4    Ter
5    Mic
dtype: object

In [238]:
monte.str.split().str[-1]

0    Chapman
1     Cleese
2    Gilliam
3       Idle
4      Jones
5      Palin
dtype: object

In [252]:
try:
    recipes = pd.read_json('recipeitems-latest.json', lines =True)
except ValueError as e:
    print(e)

In [254]:
recipes

,_id,name,ingredients,url,image,ts,cookTime,source,recipeYield,datePublished,prepTime,description,totalTime,creator,recipeCategory,dateModified,recipeInstructions
0,{'$oid': '5160756b96cc62079cc2db15'},Drop Biscuits and Sausage Gravy,Biscuits\n3 cups All-purpose Flour\n2 Tablespo...,http://thepioneerwoman.com/cooking/2013/03/dro...,http://static.thepioneerwoman.com/cooking/file...,{'$date': 1365276011104},PT30M,thepioneerwoman,12,2013-03-11,PT10M,"Late Saturday afternoon, after Marlboro Man ha...",NaN,NaN,NaN,NaN,NaN
1,{'$oid': '5160756d96cc62079cc2db16'},Hot Roast Beef Sandwiches,12 whole Dinner Rolls Or Small Sandwich Buns (...,http://thepioneerwoman.com/cooking/2013/03/hot...,http://static.thepioneerwoman.com/cooking/file...,{'$date': 1365276013902},PT20M,thepioneerwoman,12,2013-03-13,PT20M,"When I was growing up, I participated in my Ep...",NaN,NaN,NaN,NaN,NaN
2,{'$oid': '5160756f96cc6207a37ff777'},Morrocan Carrot and Chickpea Salad,Dressing:\n1 tablespoon cumin seeds\n1/3 cup /...,http://www.101cookbooks.com/archives/moroccan-...,http://www.101cookbooks.com/mt-static/images/f...,{'$date': 1365276015332},NaN,101cookbooks,NaN,2013-01-07,PT15M,A beauty of a carrot salad - tricked out with ...,NaN,NaN,NaN,NaN,NaN
3,{'$oid': '5160757096cc62079cc2db17'},Mixed Berry Shortcake,Biscuits\n3 cups All-purpose Flour\n2 Tablespo...,http://thepioneerwoman.com/cooking/2013/03/mix...,http://static.thepioneerwoman.com/cooking/file...,{'$date': 1365276016700},PT15M,thepioneerwoman,8,2013-03-18,PT15M,It's Monday! It's a brand new week! The birds ...,NaN,NaN,NaN,NaN,NaN
4,{'$oid': '5160757496cc6207a37ff778'},Pomegranate Yogurt Bowl,For each bowl: \na big dollop of Greek yogurt\...,http://www.101cookbooks.com/archives/pomegrana...,http://www.101cookbooks.com/mt-static/images/f...,{'$date': 1365276020318},NaN,101cookbooks,Serves 1.,2013-01-20,PT5M,A simple breakfast bowl made with Greek yogurt...,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
173273,{'$oid': '551c030e96cc6233c0d0dc3d'},The Easiest Homemade Vanilla Ice Cream,250 milliliters Cream\n395 grams Canned Sweete...,http://tastykitchen.com/recipes/desserts/the-e...,http://tastykitchen.com/recipes/wp-content/upl...,{'$date': 1427899150211},PT,tastykitchen,10,2015-04-01,PT10M,The easiest vanilla ice cream you will ever ma...,NaN,NaN,NaN,NaN,NaN
173274,{'$oid': '551c030f96cc6233c0d0dc3e'},Butterfinger Eggs with Vanilla,2 cups Candy Corn\n1 teaspoon Vanilla Extract\...,http://tastykitchen.com/recipes/holidays/butte...,http://tastykitchen.com/recipes/wp-content/upl...,{'$date': 1427899151232},PT5M,tastykitchen,24,2015-04-01,PT8H,Chocolate coated peanut butter eggs with a hin...,NaN,NaN,NaN,NaN,NaN
173275,{'$oid': '551c86b796cc626b1ab4d901'},The Best Homemade Taco Seasoning,1/4 cup ground cumin\n1/4 cup kosher salt\n2 t...,http://picky-palate.com/2015/04/01/the-best-ho...,http://picky-palate.com/wp-content/uploads/201...,{'$date': 1427932855918},NaN,pickypalate,Makes about 1 cup,2015-04-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN
173276,{'$oid': '551f29b696cc62227991d465'},The Ultimate Queso Bean Dip,Two 16 ounce cans Old El Paso Refried Beans\n4...,http://picky-palate.com/2015/04/03/the-ultimat...,http://picky-palate.com/wp-content/uploads/201...,{'$date': 1428105654508},NaN,pickypalate,8-10 Servings,2015-04-03,NaN,NaN,NaN,NaN,NaN,NaN,NaN
173277,{'$oid': '551f29c696cc6222a4e0c0e4'},Maple-Sweetened Banana Muffins,⅓ cup melted coconut oil or extra-virgin olive...,http://cookieandkate.com/2015/healthy-banana-m...,http://cookieandkate.com/images/2015/04/mashed...,{'$date': 1428105670708},PT25M,cookieandkate,11 muffins,NaN,PT10M,"These whole wheat, maple-sweetened banana muff...",NaN,NaN,NaN,NaN,NaN

In [256]:
recipes.shape #zwaraca ilosc kolum i wierszy

(173278, 17)

In [258]:
recipes.iloc[0]

_id                                {'$oid': '5160756b96cc62079cc2db15'}
name                                    Drop Biscuits and Sausage Gravy
ingredients           Biscuits\n3 cups All-purpose Flour\n2 Tablespo...
url                   http://thepioneerwoman.com/cooking/2013/03/dro...
image                 http://static.thepioneerwoman.com/cooking/file...
ts                                             {'$date': 1365276011104}
cookTime                                                          PT30M
source                                                  thepioneerwoman
recipeYield                                                          12
datePublished                                                2013-03-11
prepTime                                                          PT10M
description           Late Saturday afternoon, after Marlboro Man ha...
totalTime                                                           NaN
creator                                                             NaN
recipeCategory                                                      NaN
dateModified                                                        NaN
recipeInstructions                                                  NaN
Name: 0, dtype: object

In [263]:
recipes.ingredients.str.len().describe() #describe jest zajefajne xD

count    173278.000000
mean        244.617926
std         146.705285
min           0.000000
25%         147.000000
50%         221.000000
75%         314.000000
max        9067.000000
Name: ingredients, dtype: float64

In [269]:
recipes.name[recipes.ingredients.str.len()==9067].iloc[0]

'Carrot Pineapple Spice &amp; Brownie Layer Cake with Whipped Cream &amp; Cream Cheese Frosting and Marzipan Carrots'

In [273]:
recipes.name[recipes.name.str.contains('Cake')] #wsztskie przypisy ktore zawieraja słowo Cake

36        Tarta de Santiago Recipe, a Spanish Almond Cake
58                           Fresh Strawberry Yogurt Cake
240                               Strawberry Sparkle Cake
241                                    Fruit Cake Cookies
268                         Turtle Pumpkin Ice Cream Cake
                               ...
173206                   Lightened-Up Carrot Cake Muffins
173219                              Molten Chocolate Cake
173223     Chocolate Chip Chocolate Snack Cake (Egg-Free)
173230         Carrot Cake Roll with Cream Cheese Filling
173272                         Coconut Carrot Easter Cake
Name: name, Length: 7063, dtype: object

In [280]:
#szukanie przpisów zawierajacych przyprawy
spice_list = ['salt', 'pepper', 'oregano', 'sage', 'parsley',
              'rosemary', 'tarragon', 'thyme', 'paprika', 'cumin']

In [284]:
import re
recipes.ingredients.str.contains('salt',re.IGNORECASE)

0         False
1         False
2          True
3         False
4         False
          ...
173273    False
173274    False
173275     True
173276     True
173277     True
Name: ingredients, Length: 173278, dtype: bool

In [285]:
spice_df = pd.DataFrame(
    {
        spice: recipes.ingredients.str.contains(spice, re.IGNORECASE)
        for spice in spice_list
    }
)

In [286]:
spice_df

,salt,pepper,oregano,sage,parsley,rosemary,tarragon,thyme,paprika,cumin
0,False,False,False,True,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,True,True,False,False,False,False,False,False,False,True
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
173273,False,False,False,False,False,False,False,False,False,False
173274,False,False,False,False,False,False,False,False,False,False
173275,True,True,False,False,False,False,False,False,True,True
173276,True,True,False,False,False,False,False,False,False,False
173277,True,False,False,False,False,False,False,False,False,False

In [288]:
spice_df.sum() #ture =1 false =0

salt        53139
pepper      39435
oregano      3468
sage         4435
parsley      9136
rosemary     3039
tarragon     1254
thyme        5914
paprika      3528
cumin        4817
dtype: int64

In [297]:
spice_df.query('pepper & paprika')

,salt,pepper,oregano,sage,parsley,rosemary,tarragon,thyme,paprika,cumin
235,True,True,False,False,False,False,False,False,True,True
311,True,True,False,True,False,False,False,True,True,False
340,True,True,False,False,False,False,False,False,True,True
373,True,True,False,False,False,False,False,False,True,False
434,True,True,False,False,False,True,False,True,True,False
...,...,...,...,...,...,...,...,...,...,...
172891,True,True,False,False,True,False,False,False,True,False
172905,True,True,False,False,True,True,False,True,True,False
173093,True,True,False,True,False,False,False,True,True,False
173099,True,True,False,False,False,False,False,False,True,True
173275,True,True,False,False,False,False,False,False,True,True

### Cwiczenia

In [304]:
#wczytywanie pliku
df =pd.read_csv('planes.csv')

,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,N10156,2004.0,Fixed wing multi engine,EMBRAER,EMB-145XR,2,55,NaN,Turbo-fan
1,N102UW,1998.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
2,N103US,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
3,N104UW,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
4,N10575,2002.0,Fixed wing multi engine,EMBRAER,EMB-145LR,2,55,NaN,Turbo-fan
...,...,...,...,...,...,...,...,...,...
3317,N997AT,2002.0,Fixed wing multi engine,BOEING,717-200,2,100,NaN,Turbo-fan
3318,N997DL,1992.0,Fixed wing multi engine,MCDONNELL DOUGLAS AIRCRAFT CO,MD-88,2,142,NaN,Turbo-fan
3319,N998AT,2002.0,Fixed wing multi engine,BOEING,717-200,2,100,NaN,Turbo-fan
3320,N998DL,1992.0,Fixed wing multi engine,MCDONNELL DOUGLAS CORPORATION,MD-88,2,142,NaN,Turbo-jet
3321,N999DN,1992.0,Fixed wing multi engine,MCDONNELL DOUGLAS CORPORATION,MD-88,2,142,NaN,Turbo-jet

In [306]:
import sqlite3

In [307]:
conn = sqlite3.connect('filghts_db') #połaczenie z bazda danych

In [315]:
c = conn.cursor()  #kursor do sql

In [316]:
df.to_sql?

In [317]:
df.to_sql(name='planes',con=conn, if_exists='replace') #wrzucainie do bazy danych, i zabezpiecznie przed wrzucieniem dwa razy

In [ ]:
pd.read_csv?

In [338]:
files = ['airlines', 'airports', 'flights', 'planes', 'weather']
dfs={}
for file in files:
    skiprows = 54 if file == 'flights' else 0  #zaczyna czytac plik csv od 54 pozycji
    df = pd.read_csv(f'{file}.csv', skiprows=skiprows)
    dfs[file]=df
    df.to_sql(name=file, con=conn, if_exists='replace')

In [334]:
pd.read_sql_query('select*from flights;',con=conn) #wybieranie tabel z sql

,index,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
0,0,2013,1,1,517.0,515,2.0,830.0,819,11.0,UA,1545,N14228,EWR,IAH,227.0,1400,5,15,2013-01-01 05:00:00
1,1,2013,1,1,533.0,529,4.0,850.0,830,20.0,UA,1714,N24211,LGA,IAH,227.0,1416,5,29,2013-01-01 05:00:00
2,2,2013,1,1,542.0,540,2.0,923.0,850,33.0,AA,1141,N619AA,JFK,MIA,160.0,1089,5,40,2013-01-01 05:00:00
3,3,2013,1,1,544.0,545,-1.0,1004.0,1022,-18.0,B6,725,N804JB,JFK,BQN,183.0,1576,5,45,2013-01-01 05:00:00
4,4,2013,1,1,554.0,600,-6.0,812.0,837,-25.0,DL,461,N668DN,LGA,ATL,116.0,762,6,0,2013-01-01 06:00:00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
336771,336771,2013,9,30,NaN,1455,NaN,NaN,1634,NaN,9E,3393,None,JFK,DCA,NaN,213,14,55,2013-09-30 14:00:00
336772,336772,2013,9,30,NaN,2200,NaN,NaN,2312,NaN,9E,3525,None,LGA,SYR,NaN,198,22,0,2013-09-30 22:00:00
336773,336773,2013,9,30,NaN,1210,NaN,NaN,1330,NaN,MQ,3461,N535MQ,LGA,BNA,NaN,764,12,10,2013-09-30 12:00:00
336774,336774,2013,9,30,NaN,1159,NaN,NaN,1344,NaN,MQ,3572,N511MQ,LGA,CLE,NaN,419,11,59,2013-09-30 11:00:00
336775,336775,2013,9,30,NaN,840,NaN,NaN,1020,NaN,MQ,3531,N839MQ,LGA,RDU,NaN,431,8,40,2013-09-30 08:00:00

In [335]:
pd.read_sql_query('SELECT DISTINCT engine FROM planes',con=conn)# wyciagnie bezpośerdnio z sql

          engine
0      Turbo-fan
1      Turbo-jet
2  Reciprocating
3        4 Cycle
4    Turbo-shaft
5     Turbo-prop

In [339]:
dfs['planes']

,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,N10156,2004.0,Fixed wing multi engine,EMBRAER,EMB-145XR,2,55,NaN,Turbo-fan
1,N102UW,1998.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
2,N103US,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
3,N104UW,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
4,N10575,2002.0,Fixed wing multi engine,EMBRAER,EMB-145LR,2,55,NaN,Turbo-fan
...,...,...,...,...,...,...,...,...,...
3317,N997AT,2002.0,Fixed wing multi engine,BOEING,717-200,2,100,NaN,Turbo-fan
3318,N997DL,1992.0,Fixed wing multi engine,MCDONNELL DOUGLAS AIRCRAFT CO,MD-88,2,142,NaN,Turbo-fan
3319,N998AT,2002.0,Fixed wing multi engine,BOEING,717-200,2,100,NaN,Turbo-fan
3320,N998DL,1992.0,Fixed wing multi engine,MCDONNELL DOUGLAS CORPORATION,MD-88,2,142,NaN,Turbo-jet
3321,N999DN,1992.0,Fixed wing multi engine,MCDONNELL DOUGLAS CORPORATION,MD-88,2,142,NaN,Turbo-jet

In [341]:
dfs['planes']['engine']

0       Turbo-fan
1       Turbo-fan
2       Turbo-fan
3       Turbo-fan
4       Turbo-fan
          ...
3317    Turbo-fan
3318    Turbo-fan
3319    Turbo-fan
3320    Turbo-jet
3321    Turbo-jet
Name: engine, Length: 3322, dtype: object

In [344]:
dfs['planes']['engine'].unique() #wyciagenie wratosci prez słownik z tabeli prze unique

array(['Turbo-fan', 'Turbo-jet', 'Reciprocating', '4 Cycle',
       'Turbo-shaft', 'Turbo-prop'], dtype=object)

In [346]:
dfs['planes'][['tailnum','engine']].groupby('engine').count()

               tailnum
engine
4 Cycle              2
Reciprocating       28
Turbo-fan         2750
Turbo-jet          535
Turbo-prop           2
Turbo-shaft          5

In [350]:
dfs['planes'][dfs['planes']['speed'].notnull()]

,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
424,N201AA,1959.0,Fixed wing single engine,CESSNA,150,1,2,90.0,Reciprocating
427,N202AA,1980.0,Fixed wing multi engine,CESSNA,421C,2,8,90.0,Reciprocating
821,N350AA,1980.0,Fixed wing multi engine,PIPER,PA-31-350,2,8,162.0,Reciprocating
893,N364AA,1973.0,Fixed wing multi engine,CESSNA,310Q,2,6,167.0,Reciprocating
1027,N378AA,1963.0,Fixed wing single engine,CESSNA,172E,1,4,105.0,Reciprocating
1037,N381AA,1956.0,Fixed wing multi engine,DOUGLAS,DC-7BF,4,102,232.0,Reciprocating
1190,N425AA,1968.0,Fixed wing single engine,PIPER,PA-28-180,1,4,107.0,Reciprocating
1430,N508AA,1975.0,Rotorcraft,BELL,206B,1,5,112.0,Turbo-shaft
1480,N519MQ,1983.0,Fixed wing single engine,CESSNA,A185F,1,6,127.0,Reciprocating
1515,N525AA,1980.0,Fixed wing multi engine,PIPER,PA-31-350,2,8,162.0,Reciprocating
1589,N545AA,1976.0,Fixed wing single engine,PIPER,PA-32R-300,1,7,126.0,Reciprocating
1694,N567AA,1959.0,Fixed wing single engine,DEHAVILLAND,OTTER DHC-3,1,16,95.0,Reciprocating
1813,N600TR,1979.0,Fixed wing multi engine,MCDONNELL DOUGLAS,DC-9-51,2,139,432.0,Turbo-jet
1867,N615AA,1967.0,Fixed wing multi engine,BEECH,65-A90,2,9,202.0,Turbo-prop
1883,N621AA,1975.0,Fixed wing single engine,CESSNA,172M,1,4,108.0,4 Cycle
2131,N675MC,1975.0,Fixed wing multi engine,MCDONNELL DOUGLAS,DC-9-51,2,139,432.0,Turbo-jet
2309,N737MQ,1977.0,Fixed wing single engine,CESSNA,172N,1,4,105.0,Reciprocating
2402,N762NC,1976.0,Fixed wing multi engine,MCDONNELL DOUGLAS,DC-9-51,2,139,432.0,Turbo-jet
2432,N767NC,1977.0,Fixed wing multi engine,MCDONNELL DOUGLAS,DC-9-51,2,139,432.0,Turbo-jet
2472,N774NC,1978.0,Fixed wing multi engine,MCDONNELL DOUGLAS,DC-9-51,2,139,432.0,Turbo-jet
2483,N777NC,1979.0,Fixed wing multi engine,MCDONNELL DOUGLAS,DC-9-51,2,139,432.0,Turbo-jet
2492,N779NC,1979.0,Fixed wing multi engine,MCDONNELL DOUGLAS,DC-9-51,2,139,432.0,Turbo-jet
2503,N782NC,1980.0,Fixed wing multi engine,MCDONNELL DOUGLAS,DC-9-51,2,139,432.0,Turbo-jet